Revit 2027 API
BuiltInFailures.EditingFailures.LockedDeletedWarn Property
 Pinned objects deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LockedDeletedWarn { get; }
Public Shared ReadOnly Property LockedDeletedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LockedDeletedWarn {
	FailureDefinitionId^ get ();
}
static member LockedDeletedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace